#pragma once
#include "ncrapi/system/json.hpp"
const json userData = {
    {"json版本号", 0.1},
    {
        "系统信息",
        {
            {"机器人类型", "射球机"},
            {"队伍编号", "xxxx"},
            {"用户", "user"},
            {"机器人长度", 456},
            {"机器人宽度", 456},
            {"赛场边长", 3445},
            {"轮间距", 315.0},
            {"车轮直径", 104},
            {"机器重量", 8.132},
        },
    },
    {
        "自动赛",
        {
            {"自动赛&纯自动", false},
            {"红方&蓝方", true},
            {"左边&右边", false},
            {"启用视觉&不启用视觉", false},

        },
    },
    {
        "视觉信息",
        {
            {"视觉传感器前", 17},
            {"曝光度", 20},
            {"最大识别高", 75},
            {"最大识别宽", 65},
            {"数据", 0},
            {"颜色范围", {
                             {"红色", {8.8, 10.0, 11.0, 10.0, 10.0, 6.9}},
                             {"蓝色", {9.5, 11.0, 11.0, 7.0, 7.1, 11.0}},
                             {"绿色", {11.0, 9.0, 8.0, 8.3, 10.0, 5.0}},
                             {"橙色", {9.5, 11.0, 11.0, 7.0, 7.1, 11.0}},
                             {"紫色", {8.8, 10.0, 11.0, 10.0, 10.0, 6.9}},
                         }},
        },
    },
    {
        "底盘",
        {
            {"马达", {
                         {"左前", {{"端口", 1}, {"正反", true}, {"齿轮", 1}}},
                         {"左后", {{"端口", 2}, {"正反", false}, {"齿轮", 1}}},
                         {"右前", {{"端口", 3}, {"正反", false}, {"齿轮", 1}}},
                         {"右后", {{"端口", 4}, {"正反", true}, {"齿轮", 1}}},
                     }},
            {"参数", {
                         {"遥控器矫正", 10},
                         {"最大旋转速度", 127},
                         {"模式", 0},
                     }},
        },
    },
    {
        "发射器",
        {
            {"马达", {
                         {"发射L", {{"端口", 5}, {"正反", true}, {"齿轮", 1}}},
                         {"发射H", {{"端口", 6}, {"正反", true}, {"齿轮", 2}}},
                     }},
            {"参数", {
                         {"悬停值", 0},
                     }},
        },
    },
    {
        "吸吐",
        {
            {"马达", {
                         {"吸吐L", {{"端口", 7}, {"正反", false}, {"齿轮", 1}}},
                         {"吸吐R", {{"端口", 8}, {"正反", true}, {"齿轮", 1}}},
                     }},
            {"参数", {
                         {"悬停值", 0},
                     }},
        },
    },

};
